; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	infrared4 - mode
	infrared2 - mode
	image3 - mode
	image1 - mode
	thermograph0 - mode
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Phenomenon19 - direction
	Planet20 - direction
	Planet21 - direction
	Planet22 - direction
	Phenomenon23 - direction
	Phenomenon24 - direction
	Star25 - direction
	Phenomenon26 - direction
	Phenomenon27 - direction
	Phenomenon28 - direction
)
(:init
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star25)
	(supports instrument1 infrared4)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument2 image3)
	(supports instrument2 infrared4)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon11)
	(supports instrument4 image3)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star14)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon23)
)
(:goal (and
	(pointing satellite1 Planet20)
	(pointing satellite2 Star9)
	(pointing satellite4 GroundStation1)
	(have_image Planet5 infrared2)
	(have_image Phenomenon6 image1)
	(have_image Planet7 infrared4)
	(have_image Phenomenon8 image3)
	(have_image Star9 infrared4)
	(have_image Star10 image3)
	(have_image Phenomenon11 infrared2)
	(have_image Phenomenon13 infrared2)
	(have_image Star14 thermograph0)
	(have_image Star15 infrared4)
	(have_image Planet16 image3)
	(have_image Phenomenon17 infrared4)
	(have_image Star18 infrared4)
	(have_image Phenomenon19 image1)
	(have_image Planet20 image1)
	(have_image Planet21 image3)
	(have_image Planet22 infrared2)
	(have_image Phenomenon23 thermograph0)
	(have_image Phenomenon24 thermograph0)
	(have_image Star25 thermograph0)
	(have_image Phenomenon26 infrared4)
	(have_image Phenomenon27 infrared4)
	(have_image Phenomenon28 image3)
))

)

; plan
1. (switch_on instrument5 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument5)
   goals met: 0 of 26
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 26
3. (turn_to satellite4 groundstation1 phenomenon23)
   deleted: (pointing satellite4 phenomenon23)
   added: (pointing satellite4 groundstation1)
   goals met: 1 of 26
4. (calibrate satellite4 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 1 of 26
5. (turn_to satellite2 groundstation0 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 groundstation0)
   goals met: 1 of 26
6. (calibrate satellite2 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 1 of 26
7. (turn_to satellite2 phenomenon11 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon11)
   goals met: 1 of 26
8. (take_image satellite2 phenomenon11 instrument2 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 2 of 26
9. (turn_to satellite2 phenomenon13 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 26
10. (take_image satellite2 phenomenon13 instrument2 infrared2)
   added: (have_image phenomenon13 infrared2)
   goals met: 3 of 26
11. (turn_to satellite2 phenomenon17 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon17)
   goals met: 3 of 26
12. (take_image satellite2 phenomenon17 instrument2 infrared4)
   added: (have_image phenomenon17 infrared4)
   goals met: 4 of 26
13. (turn_to satellite2 phenomenon26 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon26)
   goals met: 4 of 26
14. (take_image satellite2 phenomenon26 instrument2 infrared4)
   added: (have_image phenomenon26 infrared4)
   goals met: 5 of 26
15. (turn_to satellite2 phenomenon27 phenomenon26)
   deleted: (pointing satellite2 phenomenon26)
   added: (pointing satellite2 phenomenon27)
   goals met: 5 of 26
16. (take_image satellite2 phenomenon27 instrument2 infrared4)
   added: (have_image phenomenon27 infrared4)
   goals met: 6 of 26
17. (turn_to satellite2 phenomenon28 phenomenon27)
   deleted: (pointing satellite2 phenomenon27)
   added: (pointing satellite2 phenomenon28)
   goals met: 6 of 26
18. (take_image satellite2 phenomenon28 instrument2 image3)
   added: (have_image phenomenon28 image3)
   goals met: 7 of 26
19. (turn_to satellite2 phenomenon8 phenomenon28)
   deleted: (pointing satellite2 phenomenon28)
   added: (pointing satellite2 phenomenon8)
   goals met: 7 of 26
20. (take_image satellite2 phenomenon8 instrument2 image3)
   added: (have_image phenomenon8 image3)
   goals met: 8 of 26
21. (turn_to satellite2 planet16 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 planet16)
   goals met: 8 of 26
22. (take_image satellite2 planet16 instrument2 image3)
   added: (have_image planet16 image3)
   goals met: 9 of 26
23. (turn_to satellite2 planet21 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 planet21)
   goals met: 9 of 26
24. (take_image satellite2 planet21 instrument2 image3)
   added: (have_image planet21 image3)
   goals met: 10 of 26
25. (turn_to satellite2 planet22 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 planet22)
   goals met: 10 of 26
26. (take_image satellite2 planet22 instrument2 infrared2)
   added: (have_image planet22 infrared2)
   goals met: 11 of 26
27. (turn_to satellite2 planet5 planet22)
   deleted: (pointing satellite2 planet22)
   added: (pointing satellite2 planet5)
   goals met: 11 of 26
28. (take_image satellite2 planet5 instrument2 infrared2)
   added: (have_image planet5 infrared2)
   goals met: 12 of 26
29. (turn_to satellite2 planet7 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet7)
   goals met: 12 of 26
30. (take_image satellite2 planet7 instrument2 infrared4)
   added: (have_image planet7 infrared4)
   goals met: 13 of 26
31. (turn_to satellite2 star10 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star10)
   goals met: 13 of 26
32. (take_image satellite2 star10 instrument2 image3)
   added: (have_image star10 image3)
   goals met: 14 of 26
33. (turn_to satellite2 star15 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star15)
   goals met: 14 of 26
34. (take_image satellite2 star15 instrument2 infrared4)
   added: (have_image star15 infrared4)
   goals met: 15 of 26
35. (turn_to satellite2 star18 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star18)
   goals met: 15 of 26
36. (take_image satellite2 star18 instrument2 infrared4)
   added: (have_image star18 infrared4)
   goals met: 16 of 26
37. (turn_to satellite2 star9 star18)
   deleted: (pointing satellite2 star18)
   added: (pointing satellite2 star9)
   goals met: 17 of 26
38. (take_image satellite2 star9 instrument2 infrared4)
   added: (have_image star9 infrared4)
   goals met: 18 of 26
39. (turn_to satellite1 planet20 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet20)
   goals met: 19 of 26
40. (turn_to satellite4 phenomenon19 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon19)
   goals met: 18 of 26
41. (take_image satellite4 phenomenon19 instrument5 image1)
   added: (have_image phenomenon19 image1)
   goals met: 19 of 26
42. (turn_to satellite4 groundstation1 phenomenon19)
   deleted: (pointing satellite4 phenomenon19)
   added: (pointing satellite4 groundstation1)
   goals met: 20 of 26
43. (turn_to satellite4 phenomenon23 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon23)
   goals met: 19 of 26
44. (take_image satellite4 phenomenon23 instrument5 thermograph0)
   added: (have_image phenomenon23 thermograph0)
   goals met: 20 of 26
45. (turn_to satellite4 groundstation1 phenomenon23)
   deleted: (pointing satellite4 phenomenon23)
   added: (pointing satellite4 groundstation1)
   goals met: 21 of 26
46. (turn_to satellite4 phenomenon24 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon24)
   goals met: 20 of 26
47. (take_image satellite4 phenomenon24 instrument5 thermograph0)
   added: (have_image phenomenon24 thermograph0)
   goals met: 21 of 26
48. (turn_to satellite4 groundstation1 phenomenon24)
   deleted: (pointing satellite4 phenomenon24)
   added: (pointing satellite4 groundstation1)
   goals met: 22 of 26
49. (turn_to satellite4 phenomenon6 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon6)
   goals met: 21 of 26
50. (take_image satellite4 phenomenon6 instrument5 image1)
   added: (have_image phenomenon6 image1)
   goals met: 22 of 26
51. (turn_to satellite4 groundstation1 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 groundstation1)
   goals met: 23 of 26
52. (turn_to satellite4 planet20 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 planet20)
   goals met: 22 of 26
53. (take_image satellite4 planet20 instrument5 image1)
   added: (have_image planet20 image1)
   goals met: 23 of 26
54. (turn_to satellite4 groundstation1 planet20)
   deleted: (pointing satellite4 planet20)
   added: (pointing satellite4 groundstation1)
   goals met: 24 of 26
55. (turn_to satellite4 star14 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 star14)
   goals met: 23 of 26
56. (take_image satellite4 star14 instrument5 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 24 of 26
57. (turn_to satellite4 groundstation1 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 groundstation1)
   goals met: 25 of 26
58. (turn_to satellite4 star25 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 star25)
   goals met: 24 of 26
59. (take_image satellite4 star25 instrument5 thermograph0)
   added: (have_image star25 thermograph0)
   goals met: 25 of 26
60. (turn_to satellite4 groundstation1 star25)
   deleted: (pointing satellite4 star25)
   added: (pointing satellite4 groundstation1)
   goals met: 26 of 26
